# 1. Дан список чисел. Определите, сколько в нем встречается различных чисел.
#     - Примечание. Эту задачу на Питоне можно решить в одну строчку.

# a = set('354365435643645836543654365485684')
# # print(a)

print('Set length:', len(set('354365435643645836543654365485684')))
