# 2. Даны два списка чисел. Посчитайте, сколько чисел содержится одновременно как в первом списке, так и во втором.
#     - Примечание. Эту задачу на Питоне можно решить в одну строчку.

print('Two Set length:', len(set('354365435643645836543654365485684')) + len(set('78/96846351687435416987464568')))